import json
def jopa(read_file):
        data = json.load(read_file)
        for i in range(0, len(data)):
                for o in range (0, len(_slovar)):
                        zip(_slovar.keys(), _slovar.values())


_slovar = {'Physiha': ["физика","влажность","частица","тело","колебания","мощность","энергия","адиабата","давление","волна","атом","звук","..."], 
'Chem': ["абсорбция","соль","кислота","оксид","метан","амины","белки","соединение","спирт","реакиця","сублимация","химия","..."],
'Math': ["ордината","ось","абцисса","сумма","разность","произведение","алгебра","ассиметрия","интеграл","предел","ряд","матрица","..."],
'Bio': ["бактерия","фагоцетоз","фотосинтез","атф","днк","рнк","вид","гамета","гибрид","зигота","клетка","мох","..."],
'Rus': ["аллегория","анафора","троп","фразеологизм","экспрессия","эпитет","синоним","антоним","омоним","олицетворение","литота","инверсия","..."],
'Hist': ["варяги","вече","дьяк","ересь","гвардия","колония","война","устав","закон","общество","раскол","рекрут","..."],
'Psyho': ["агрессия","альтруизм","сангвиник","холерик","меланхолик","ипохондрия","мировоззрение","мышление","творчество","тревога","поведение","познание","..."],
'Computer': ["адаптер","антивирус","алгоритм","база данных","жесткий диск","память","конъюнкция","дизъюнкция","драйвер","дисплей","python","c++","..."]
 }

 ('',['',''])
 t = t[1]