import json
_namePhysics = ("физика","влажность","частица","тело","колебания","мощность","энергия","адиабата","давление","волна","атом","звук","...")
_nameComputer = ("адаптер","антивирус","алгоритм","база данных","жесткий диск","память","конъюнкция","дизъюнкция","драйвер","дисплей","python","c++","...") 
_nameChemistry = ("абсорбция","соль","кислота","оксид","метан","амины","белки","соединение","спирт","реакиця","сублимация","химия","...")
_nameMath = ("ордината","ось","абцисса","сумма","разность","произведение","алгебра","ассиметрия","интеграл","предел","ряд","матрица","...")
_nameBiology = ("бактерия","фагоцетоз","фотосинтез","атф","днк","рнк","вид","гамета","гибрид","зигота","клетка","мох","...")
_nameRus = ("аллегория","анафора","троп","фразеологизм","экспрессия","эпитет","синоним","антоним","омоним","олицетворение","литота","инверсия","...")
_nameHist = ("варяги","вече","дьяк","ересь","гвардия","колония","война","устав","закон","общество","раскол","рекрут","...")
_namePsyho = ("агрессия","альтруизм","сангвиник","холерик","меланхолик","ипохондрия","мировоззрение","мышление","творчество","тревога","поведение","познание","...")
def jopa(putb_file):
    with open(putb_file + ".json", "r") as read_file:
        data = json.load(read_file)